In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.686919 -0.928538 -0.825175 -0.047921
2013-01-02 -1.795466  0.748347 -0.040298  0.663517
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665
2013-01-04  0.394821  0.033237 -0.637164 -0.106211
2013-01-05  0.046746 -1.168984  1.790976  0.524770
2013-01-06  0.133073  1.143228 -0.379599  1.496657

In [9]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3]*4,dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head(2)

                   A         B         C         D
2013-01-01 -0.686919 -0.928538 -0.825175 -0.047921
2013-01-02 -1.795466  0.748347 -0.040298  0.663517

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.394821  0.033237 -0.637164 -0.106211
2013-01-05  0.046746 -1.168984  1.790976  0.524770
2013-01-06  0.133073  1.143228 -0.379599  1.496657

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[-0.68691904, -0.92853759, -0.82517511, -0.04792091],
       [-1.79546638,  0.74834744, -0.04029811,  0.66351706],
       [ 0.78219228, -1.74256968, -0.1065091 , -0.43866504],
       [ 0.39482058,  0.0332374 , -0.63716397, -0.10621126],
       [ 0.04674583, -1.16898419,  1.79097617,  0.52476953],
       [ 0.13307324,  1.14322766, -0.37959937,  1.49665654]])

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.187592 -0.319213 -0.032962  0.348691
std    0.924339  1.142101  0.942871  0.697440
min   -1.795466 -1.742570 -0.825175 -0.438665
25%   -0.503503 -1.108873 -0.572773 -0.091639
50%    0.089910 -0.447650 -0.243054  0.238424
75%    0.329384  0.569570 -0.056851  0.628830
max    0.782192  1.143228  1.790976  1.496657

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.686919   -1.795466    0.782192    0.394821    0.046746    0.133073
B   -0.928538    0.748347   -1.742570    0.033237   -1.168984    1.143228
C   -0.825175   -0.040298   -0.106509   -0.637164    1.790976   -0.379599
D   -0.047921    0.663517   -0.438665   -0.106211    0.524770    1.496657

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.047921 -0.825175 -0.928538 -0.686919
2013-01-02  0.663517 -0.040298  0.748347 -1.795466
2013-01-03 -0.438665 -0.106509 -1.742570  0.782192
2013-01-04 -0.106211 -0.637164  0.033237  0.394821
2013-01-05  0.524770  1.790976 -1.168984  0.046746
2013-01-06  1.496657 -0.379599  1.143228  0.133073

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665
2013-01-05  0.046746 -1.168984  1.790976  0.524770
2013-01-01 -0.686919 -0.928538 -0.825175 -0.047921
2013-01-04  0.394821  0.033237 -0.637164 -0.106211
2013-01-02 -1.795466  0.748347 -0.040298  0.663517
2013-01-06  0.133073  1.143228 -0.379599  1.496657

In [22]:
df['A']

2013-01-01   -0.686919
2013-01-02   -1.795466
2013-01-03    0.782192
2013-01-04    0.394821
2013-01-05    0.046746
2013-01-06    0.133073
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.686919 -0.928538 -0.825175 -0.047921
2013-01-02 -1.795466  0.748347 -0.040298  0.663517
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.795466  0.748347 -0.040298  0.663517
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665
2013-01-04  0.394821  0.033237 -0.637164 -0.106211

In [25]:
df.loc[dates[0]]

A   -0.686919
B   -0.928538
C   -0.825175
D   -0.047921
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.686919 -0.928538
2013-01-02 -1.795466  0.748347
2013-01-03  0.782192 -1.742570
2013-01-04  0.394821  0.033237
2013-01-05  0.046746 -1.168984
2013-01-06  0.133073  1.143228

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.795466  0.748347
2013-01-03  0.782192 -1.742570
2013-01-04  0.394821  0.033237

In [28]:
df.loc['20130102',['A','B']]

A   -1.795466
B    0.748347
Name: 2013-01-02 00:00:00, dtype: float64

In [29]:
df.loc[dates[0],'A']

-0.6869190425203885

In [30]:
df.at[dates[0],'A']

-0.6869190425203885

In [31]:
df.iloc[3]

A    0.394821
B    0.033237
C   -0.637164
D   -0.106211
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.394821  0.033237
2013-01-05  0.046746 -1.168984

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.795466 -0.040298
2013-01-03  0.782192 -0.106509
2013-01-05  0.046746  1.790976

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.795466  0.748347 -0.040298  0.663517
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.928538 -0.825175
2013-01-02  0.748347 -0.040298
2013-01-03 -1.742570 -0.106509
2013-01-04  0.033237 -0.637164
2013-01-05 -1.168984  1.790976
2013-01-06  1.143228 -0.379599

In [36]:
df.iloc[2,2]

-0.10650910265911125

In [37]:
df.iat[2,2]

-0.10650910265911125

In [38]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665
2013-01-04  0.394821  0.033237 -0.637164 -0.106211
2013-01-05  0.046746 -1.168984  1.790976  0.524770
2013-01-06  0.133073  1.143228 -0.379599  1.496657

In [39]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN  0.748347       NaN  0.663517
2013-01-03  0.782192       NaN       NaN       NaN
2013-01-04  0.394821  0.033237       NaN       NaN
2013-01-05  0.046746       NaN  1.790976  0.524770
2013-01-06  0.133073  1.143228       NaN  1.496657

In [40]:
df2 = df.copy()

In [41]:
df2['E']=['one', 'one', 'two', 'three', 'four', 'three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01 -0.686919 -0.928538 -0.825175 -0.047921    one
2013-01-02 -1.795466  0.748347 -0.040298  0.663517    one
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665    two
2013-01-04  0.394821  0.033237 -0.637164 -0.106211  three
2013-01-05  0.046746 -1.168984  1.790976  0.524770   four
2013-01-06  0.133073  1.143228 -0.379599  1.496657  three

In [43]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.782192 -1.742570 -0.106509 -0.438665   two
2013-01-05  0.046746 -1.168984  1.790976  0.524770  four

In [44]:
sl = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [45]:
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df['F'] = sl

In [47]:
df.at[dates[0], 'A'] = 0

In [48]:
df.iat[0,1]=0

In [49]:
df.loc[:,'D'] = np.array([5] * len(df))

In [50]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.825175  5  NaN
2013-01-02 -1.795466  0.748347 -0.040298  5  1.0
2013-01-03  0.782192 -1.742570 -0.106509  5  2.0
2013-01-04  0.394821  0.033237 -0.637164  5  3.0
2013-01-05  0.046746 -1.168984  1.790976  5  4.0
2013-01-06  0.133073  1.143228 -0.379599  5  5.0

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

In [52]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [53]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.825175  5  NaN  1.0
2013-01-02 -1.795466  0.748347 -0.040298  5  1.0  1.0
2013-01-03  0.782192 -1.742570 -0.106509  5  2.0  NaN
2013-01-04  0.394821  0.033237 -0.637164  5  3.0  NaN

In [54]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.795466  0.748347 -0.040298  5  1.0  1.0

In [55]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.825175  5  5.0  1.0
2013-01-02 -1.795466  0.748347 -0.040298  5  1.0  1.0
2013-01-03  0.782192 -1.742570 -0.106509  5  2.0  5.0
2013-01-04  0.394821  0.033237 -0.637164  5  3.0  5.0

In [56]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [57]:
df.mean()

A   -0.073106
B   -0.164457
C   -0.032962
D    5.000000
F    3.000000
dtype: float64

In [58]:
df.mean(1)

2013-01-01    1.043706
2013-01-02    0.982517
2013-01-03    1.186623
2013-01-04    1.558179
2013-01-05    1.933748
2013-01-06    2.179340
Freq: D, dtype: float64

In [59]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [60]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [61]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.217808 -2.742570 -1.106509  4.0  1.0
2013-01-04 -2.605179 -2.966763 -3.637164  2.0  0.0
2013-01-05 -4.953254 -6.168984 -3.209024  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [62]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.825175   5   NaN
2013-01-02 -1.795466  0.748347 -0.865473  10   1.0
2013-01-03 -1.013274 -0.994222 -0.971982  15   3.0
2013-01-04 -0.618454 -0.960985 -1.609146  20   6.0
2013-01-05 -0.571708 -2.129969  0.181830  25  10.0
2013-01-06 -0.438634 -0.986741 -0.197769  30  15.0

In [63]:
df.apply(lambda x: x.max() - x.min())

A    2.577659
B    2.885797
C    2.616151
D    0.000000
F    4.000000
dtype: float64

In [64]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [65]:
s

0    0
1    2
2    6
3    6
4    5
5    6
6    2
7    1
8    3
9    6
dtype: int64

In [66]:
s.value_counts()

6    4
2    2
5    1
3    1
1    1
0    1
dtype: int64

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [69]:
df = pd.DataFrame(np.random.randn(10,4))

In [70]:
df

          0         1         2         3
0 -0.731948  0.423442  0.287120 -0.405892
1 -0.131201  0.143022  0.308334 -0.315722
2 -0.682953 -0.019830  0.729443 -0.210757
3  0.411032 -0.144378  0.449311 -0.285344
4 -0.646007 -0.088930  1.616462  0.466829
5  0.299613 -0.257836 -0.048008  1.665676
6 -1.634976 -0.683581  0.367713  0.447845
7  1.328383 -1.790843  0.693320 -1.495514
8  0.684683  0.111677  1.093376  0.548678
9  0.511962 -0.547079 -0.344766 -0.369517

In [71]:
pieces = [df[:3], df[3:7], df[7:]]

In [72]:
pd.concat(pieces)

          0         1         2         3
0 -0.731948  0.423442  0.287120 -0.405892
1 -0.131201  0.143022  0.308334 -0.315722
2 -0.682953 -0.019830  0.729443 -0.210757
3  0.411032 -0.144378  0.449311 -0.285344
4 -0.646007 -0.088930  1.616462  0.466829
5  0.299613 -0.257836 -0.048008  1.665676
6 -1.634976 -0.683581  0.367713  0.447845
7  1.328383 -1.790843  0.693320 -1.495514
8  0.684683  0.111677  1.093376  0.548678
9  0.511962 -0.547079 -0.344766 -0.369517

In [73]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1,2]})

In [74]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval':[4,5]})

In [75]:
left

   key  lval
0  foo     1
1  foo     2

In [76]:
right

   key  rval
0  foo     4
1  foo     5

In [77]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [78]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval':[1,2]})

In [79]:
right = pd.DataFrame({'key':['foo', 'bar'], 'rval':[4,5]})

In [80]:
left

   key  lval
0  foo     1
1  bar     2

In [81]:
right

   key  rval
0  foo     4
1  bar     5

In [82]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [83]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])

In [84]:
df

          A         B         C         D
0  1.599922  1.026039  1.235647 -0.881562
1  1.343258  0.736885  1.268491  1.818777
2 -0.346804  1.806420  0.210283 -0.223557
3  0.743059  1.193239 -0.139454 -0.674490
4  1.065766 -0.493487  0.533097 -0.574251
5  0.386984 -1.077951 -0.208123 -0.152027
6 -0.943516  0.520197  0.656316 -1.159142
7  1.314348  0.694101 -0.062292 -0.446522

In [85]:
s = df.iloc[3]

In [86]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.599922  1.026039  1.235647 -0.881562
1  1.343258  0.736885  1.268491  1.818777
2 -0.346804  1.806420  0.210283 -0.223557
3  0.743059  1.193239 -0.139454 -0.674490
4  1.065766 -0.493487  0.533097 -0.574251
5  0.386984 -1.077951 -0.208123 -0.152027
6 -0.943516  0.520197  0.656316 -1.159142
7  1.314348  0.694101 -0.062292 -0.446522
8  0.743059  1.193239 -0.139454 -0.674490

In [87]:
df = pd.DataFrame({'A':['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B':['one','one','two','three','two','two','one','tree'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [88]:
df

     A      B         C         D
0  foo    one  0.154520 -0.838721
1  bar    one  1.840344 -0.687796
2  foo    two  0.534710  0.539245
3  bar  three  1.472063 -0.823231
4  foo    two -0.056363 -0.344573
5  bar    two  1.378898 -0.743918
6  foo    one -1.336380 -1.341374
7  foo   tree -0.781297 -0.144827

In [89]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],'C': np.random.randn(8),
   ....:                    'D': np.random.randn(8)})

In [90]:
df

     A      B         C         D
0  foo    one -0.403208 -0.039869
1  bar    one  0.710237  0.064752
2  foo    two -0.860353  0.709785
3  bar  three -0.275209 -0.395572
4  foo    two -0.929285  0.139216
5  bar    two -0.274462 -1.057179
6  foo    one  1.637265 -0.297872
7  foo  three  0.849329  1.062748

In [91]:
df.groupby('A').sum()

            C         D
A
bar  0.160566 -1.387999
foo  0.293749  1.574008

In [92]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.710237  0.064752
    three -0.275209 -0.395572
    two   -0.274462 -1.057179
foo one    1.234057 -0.337742
    three  0.849329  1.062748
    two   -1.789637  0.849001

In [93]:
tuples = list(zip(*[['bar','bar','baz','baz','foo','foo','qux','qux'],
                    ['one','two','one','two','one','two','one','two']]))

In [94]:
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])

In [95]:
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A','B'])

In [96]:
df2 = df[:4]

In [97]:
df2

                     A         B
first second
bar   one     1.219426 -0.175306
      two    -0.195238  0.700273
baz   one    -1.529142 -0.145908
      two    -1.699222 -0.597122

In [98]:
stacked = df2.stack()

In [99]:
stacked

first  second
bar    one     A    1.219426
               B   -0.175306
       two     A   -0.195238
               B    0.700273
baz    one     A   -1.529142
               B   -0.145908
       two     A   -1.699222
               B   -0.597122
dtype: float64

In [101]:
stacked.unstack

<bound method Series.unstack of first  second
bar    one     A    1.219426
               B   -0.175306
       two     A   -0.195238
               B    0.700273
baz    one     A   -1.529142
               B   -0.145908
       two     A   -1.699222
               B   -0.597122
dtype: float64>

In [102]:
stacked.unstack(1)

second        one       two
first
bar   A  1.219426 -0.195238
      B -0.175306  0.700273
baz   A -1.529142 -1.699222
      B -0.145908 -0.597122

In [103]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.219426 -1.529142
       B -0.175306 -0.145908
two    A -0.195238 -1.699222
       B  0.700273 -0.597122

In [106]:
df = pd.DataFrame({'A':['one','one','two','three']*3, 'B':['A','B','C']*4, 'C':['foo','foo','foo','bar','bar','bar']*2, 'D':np.random.randn(12), 'E':np.random.randn(12)})

In [107]:
df

        A  B    C         D         E
0     one  A  foo  1.017781 -0.007328
1     one  B  foo  1.902293 -0.499085
2     two  C  foo  0.707631 -1.102120
3   three  A  bar -2.097704  1.764360
4     one  B  bar  0.576992  0.072379
5     one  C  bar -0.333589  0.952326
6     two  A  foo  1.292308  0.404271
7   three  B  foo  0.021291 -0.582984
8     one  C  foo  1.201362 -0.355863
9     one  A  bar -1.103114  1.066552
10    two  B  bar -1.031672 -0.829102
11  three  C  bar -0.144582  0.422948

In [108]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A -1.103114  1.017781
      B  0.576992  1.902293
      C -0.333589  1.201362
three A -2.097704       NaN
      B       NaN  0.021291
      C -0.144582       NaN
two   A       NaN  1.292308
      B -1.031672       NaN
      C       NaN  0.707631

In [111]:
rng = pd.date_range('1/1/2012',periods=100,freq='S')